# coding: utf-8
# 题目：有n个人围成一圈，顺序排号。从第一个人开始报数（从1到3报数），凡报到3的人退出圈子，问最后留下的是原来第几号的那位。

# 11 人
# 1 2 3 4 5 6 7 8 9 10 11
# 1 2 3 1 2 3 1 2 3 1  2
# 1 2 4 5 7 8 10 11
# 3 1 2 3 1 2 3  1
# 2 4 7 8 11
# 2 3 1 2 3
# 2 7 8
# 1 2 3
# 2 7
# 1 2
# 3
# 7


def last(n):
    L = [i for i in range(1, n+1)]
    k = 1
    while len(L) > 1:
        M = []

        for j in range(k, len(L)+k):
            if j % 3 != 0:
                M.append(L[j-k])
                #print(M)
        print(len(M))
        k = (len(L)+k) % 3
        L[:] = M[:]
        print(L)
        if len(L) == 2:
            del L[0]
    print(L)

# 1, 2, 4, 5, 7, 8, 10, 11, 13, 14, 16, 17, 19, 20, 22, 23, 25, 26, 28, 29, 31, 32, 34
# 2  3  1  2  3  1  2   3   1   2   3   1   2   3   1   2   3   1   2   3   1   2   3
# 1,  4, 5, 8, 10, 13, 14,  17, 19,  22, 23,  26, 28, 31, 32       15
# 1   2  3  1  2   3   1    2   3    1   2    3   1   2   3
# 1,  4, 8, 10, 14,  17,  22, 23,  28, 31    10
# 1,  4, 10, 14,   22, 23,   31
# 1,   10, 14,    23,   31
# 10, 14,    31
# 10,  31
# 10


last(34)
